app/controllers/admin/users_controller.rb

  def index
    @users = User.all(:order => "email")
---
SELECT "users".* FROM "users" ORDER BY email

  def create
    @user = User.new(params[:user], :as => :admin)
    if @user.save
---
INSERT INTO "users" ("admin", "confirmation_sent_at", "confirmation_token", "confirmed_at", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "last_sign_in_at", "last_sign_in_ip", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "unconfirmed_email", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user.skip_reconfirmation!
    if params[:user][:password].blank?
      params[:user].delete(:password)
      params[:user].delete(:password_confirmation)
    end

    if @user.update_attributes(params[:user], :as => :admin)
---
UPDATE "users" SET "email" = 'newguy@example.com', "updated_at" = '2013-07-18 22:42:32.207897' WHERE "users"."id" = 2

  def destroy
    if @user == current_user
      flash[:alert] = "You cannot delete yourself!"
    else
      @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]