app/views/tickets/show.html.erb

<! asset is the name used for attaching files !>
  <% if @ticket.assets.exists? %>
---
SELECT "assets".* FROM "assets" WHERE "assets"."ticket_id" = 1
SELECT 1 AS one FROM "assets" WHERE "assets"."ticket_id" = 1 LIMIT 1