app/controllers/projects_controller.rb

	def index
    @projects = Project.for(current_user).all
---
SELECT "projects".* FROM "projects"

	def create  #based on user input
  	@project = Project.new(params[:project])
  	if @project.save  # returns true or false
---
INSERT INTO "projects" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 10 Jul 2013 23:58:39 UTC +00:00], ["description", "A text-editor for OS X"], ["name", "TextMate 2"], ["updated_at", Wed, 10 Jul 2013 23:58:39 UTC +00:00]]

  def update
    #@project = Project.find(params[:id])
    if @project.update_attributes(params[:project])
---
UPDATE "projects" SET "name" = 'TextMate 2 beta', "updated_at" = '2013-07-11 23:10:39.632586' WHERE "projects"."id" = 1

  def destroy
    #@project = Project.find(params[:id])
    @project.destroy
---
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]

  def find_project
    #@project = Project.find(params[:id])
    @project = Project.for(current_user).find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]