app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("created_at", "description", "project_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 15 Jul 2013 23:25:42 UTC +00:00], ["description", ""], ["project_id", 1], ["title", ""], ["updated_at", Mon, 15 Jul 2013 23:25:42 UTC +00:00]]
---
  def create
    if cannot?(:tag, @project)
      params[:ticket].delete(:tag_names)
    end

    @ticket = @project.tickets.build(params[:ticket])
    @ticket.user = current_user
    if @ticket.save

UPDATE "tickets" SET "title" = 'Make it really shiny!', "description" = '
---
  def update
    if @ticket.update_attributes(params[:ticket])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def find_project
    @project = Project.for(current_user).find(params[:project_id])

SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = 1 AND "tickets"."id" = ? LIMIT 1  [["id", "1"]]
---
  def find_ticket
    @ticket = @project.tickets.find(params[:id])